Revit 2027 API
AreaBasedLoadBoundaryLineData.BottomLevelId Property
 The bottom level id of the area based load boundary line.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BottomLevelId { get; set; }
Public Property BottomLevelId As ElementId
	Get
	Set
public:
property ElementId^ BottomLevelId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member BottomLevelId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The ElementId levelId cannot be used as the bottom level. The ElementId levelId is not a Level or it's elevation is higher than the top level's elevation.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The bottom level's elevation cannot be higher than the top level.
See Also
Reference
AreaBasedLoadBoundaryLineData Class
Autodesk.Revit.DB.Electrical Namespace